# Напишите программу, которая проводит проверку правильности хэшей в
# модельном блокчейне с простой хэш-функцией.


# Формат вывода
# Следует вывести номер первого блока, у которого неправильный хэш
# (не меньше 100 или не совпадает с вычисленным по указанной в условии
#  формуле), или -1, если все хэши в блокчейне правильные. Нумерация
# блоков идёт с нуля, т. е. они имеют номера от 0 до N-1.

# Подсказка
# Пример 1
# Ввод
# 5
# 6122802
# 14406496
# 15230209
# 2541121
# 1758741
# Вывод
# -1
# Пример 2
# Ввод
# 5
# 1865535
# 13479687
# 16689153
# 1839958
# 5214020
# Вывод
# 3

# generated by CharGPT!!!

N = int(input())  # количество блоков
blocks = [int(input()) for _ in range(N)]

prev_hash = 0  # h_(-1) = 0 для первого блока

for i in range(N):
    b = blocks[i]

    # Извлекаем h, r, m из b
    h = b % 256
    r = (b // 256) % 256
    m = b // (256 * 256)

    # Вычисляем ожидаемый хэш
    expected_h = (37 * (m + r + prev_hash)) % 256

    # Проверяем условия
    if h >= 100 or h != expected_h:
        print(i)
        break

    prev_hash = h
else:
    print(-1)
