# Формат ввода
# Ввод не требуется.

# Формат вывода
# Выведите одну строку:

# Привет, Яндекс!

print("Привет, Яндекс!")
