# Формат ввода
# Одна строка — весьма полезная информация.

# Формат вывода
# Трижды повторённая весьма полезная информация.


# Пример 1
# Ввод
# 2 + 2 = 4
# Вывод
# 2 + 2 = 4
# 2 + 2 = 4
# 2 + 2 = 4

string = input()
print(string)
print(string)
print(string)
